app/controllers/application_controller.rb

  def authorize_request
    token = request.headers["Authorization"]&.split(" ")&.last
    begin
      decoded_token = JWT.decode(token, Rails.application.credentials.secret_key_base)
      @current_battery = MoonBattery.find(decoded_token[0]["battery_id"])
---
SELECT `moon_batteries`.* FROM `moon_batteries` WHERE `moon_batteries`.`id` = 3 LIMIT 1