app/controllers/auth_controller.rb

  def login
    moon_battery = MoonBattery.find_by(mac_address: params[:moon_battery][:mac_address])
---
SELECT `moon_batteries`.* FROM `moon_batteries` WHERE `moon_batteries`.`mac_address` = '01-B0-D0-63-C2-22' LIMIT 1