app/controllers/moon_batteries_controller.rb

INSERT INTO `moon_batteries` (`mac_address`, `serial_number`, `last_ping`, `charge_level`, `connected_lunar_cell_id`, `created_at`, `updated_at`) VALUES ('01-B0-D0-63-C2-22', '8114CF', NULL, 0, NULL, '2024-10-15 12:34:30.208981', '2024-10-15 12:34:30.208981')
---
  def register
    moon_battery = MoonBattery.new(moon_battery_params)
    if moon_battery.save

SELECT `configurations`.* FROM `configurations` WHERE `configurations`.`moon_battery_id` = 2 AND `configurations`.`key` = 'temperature' LIMIT 1
---
  def configure
    moon_battery = find_moon_battery
    if moon_battery
      configurations = params[:moon_battery][:configurations]
      configurations.each do |config|
        config.each do |key, value|
          configuration = moon_battery.configurations.find_or_initialize_by(key: key)

SELECT `moon_batteries`.* FROM `moon_batteries` WHERE `moon_batteries`.`mac_address` = '01-B0-D0-63-C2-22' LIMIT 1
---
  def find_moon_battery
    if params[:moon_battery][:mac_address]
      MoonBattery.find_by(mac_address: params[:moon_battery][:mac_address])